app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `campaigns_list`, `created_at`, `updated_at`) VALUES ('Alice4', 'alice4@gmail.com', '[{\"campaign_name\":\"cam7\",\"campaign_id\":\"id7\"},{\"campaign_name\":\"cam6\",\"campaign_id\":\"id6\"}]', '2024-07-12 06:31:37.069439', '2024-07-12 06:31:37.069439')
---
  def create
    @user = User.new(user_params)
    if @user.save