app/models/user.rb

  def self.get_user_by_campaign_name(campaign_names)
    User.select { |user| user.campaigns_list.any? { |campaign| campaign["campaign_name"].in?(campaign_names) } }
---
SELECT `users`.* FROM `users`

  def self.fetch_campaign_names
    all.map do |user|
---
SELECT `users`.* FROM `users`